{"resources":{"ms365.exchangeonline":{"id":"ms365.exchangeonline","name":"ms365.exchangeonline","fields":{"adminAuditLogConfig":{"name":"adminAuditLogConfig","type":"\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"antiPhishPolicy":{"name":"antiPhishPolicy","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"atpPolicyForO365":{"name":"atpPolicyForO365","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"authenticationPolicy":{"name":"authenticationPolicy","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"dkimSigningConfig":{"name":"dkimSigningConfig","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"hostedOutboundSpamFilterPolicy":{"name":"hostedOutboundSpamFilterPolicy","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"mailbox":{"name":"mailbox","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"malwareFilterPolicy":{"name":"malwareFilterPolicy","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"organizationConfig":{"name":"organizationConfig","type":"\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"owaMailboxPolicy":{"name":"owaMailboxPolicy","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"phishFilterPolicy":{"name":"phishFilterPolicy","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"remoteDomain":{"name":"remoteDomain","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"roleAssignmentPolicy":{"name":"roleAssignmentPolicy","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"safeAttachmentPolicy":{"name":"safeAttachmentPolicy","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"safeLinksPolicy":{"name":"safeLinksPolicy","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"sharingPolicy":{"name":"sharingPolicy","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"},"transportRule":{"name":"transportRule","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 ExchangeOnline"}},"title":"Microsoft 365 ExchangeOnline"},"ms365.sharepointonline":{"id":"ms365.sharepointonline","name":"ms365.sharepointonline","fields":{"spoTenant":{"name":"spoTenant","type":"\n","is_mandatory":true,"title":"Microsoft 365 SharepointOnline"},"spoTenantSyncClientRestriction":{"name":"spoTenantSyncClientRestriction","type":"\n","is_mandatory":true,"title":"Microsoft 365 SharepointOnline"}},"title":"Microsoft 365 SharepointOnline"},"ms365.teams":{"id":"ms365.teams","name":"ms365.teams","fields":{"csOAuthConfiguration":{"name":"csOAuthConfiguration","type":"\u0019\n","is_mandatory":true,"title":"Microsoft 365 Teams"},"csTeamsClientConfiguration":{"name":"csTeamsClientConfiguration","type":"\n","is_mandatory":true,"title":"Microsoft 365 Teams"}},"title":"Microsoft 365 Teams"},"msgraph.beta":{"id":"msgraph.beta","name":"msgraph.beta","fields":{"applications":{"name":"applications","type":"\u0019\u001bmsgraph.beta.application","title":"Microsoft Graph Beta"},"domains":{"name":"domains","type":"\u0019\u001bmsgraph.beta.domain","title":"Microsoft Graph Beta"},"organizations":{"name":"organizations","type":"\u0019\u001bmsgraph.beta.organization","title":"Microsoft Graph Beta"},"settings":{"name":"settings","type":"\u0019\n","title":"Microsoft Graph Beta"},"users":{"name":"users","type":"\u0019\u001bmsgraph.beta.user","title":"Microsoft Graph Beta"}},"title":"Microsoft Graph Beta"},"msgraph.beta.application":{"id":"msgraph.beta.application","name":"msgraph.beta.application","fields":{"appId":{"name":"appId","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Application"},"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true,"title":"Microsoft Graph Beta Application"},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Application"},"id":{"name":"id","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Application"},"identifierUris":{"name":"identifierUris","type":"\u0019\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Application"},"publisherDomain":{"name":"publisherDomain","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Application"},"signInAudience":{"name":"signInAudience","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Application"}},"title":"Microsoft Graph Beta Application"},"msgraph.beta.devicemanagement":{"id":"msgraph.beta.devicemanagement","name":"msgraph.beta.devicemanagement","fields":{"deviceCompliancePolicies":{"name":"deviceCompliancePolicies","type":"\u0019\u001bmsgraph.beta.devicemanagement.devicecompliancepolicy","title":"Microsoft Graph Beta Device Management"},"deviceConfigurations":{"name":"deviceConfigurations","type":"\u0019\u001bmsgraph.beta.devicemanagement.deviceconfiguration","title":"Microsoft Graph Beta Device Management"}},"title":"Microsoft Graph Beta Device Management"},"msgraph.beta.devicemanagement.devicecompliancepolicy":{"id":"msgraph.beta.devicemanagement.devicecompliancepolicy","name":"msgraph.beta.devicemanagement.devicecompliancepolicy","fields":{"assignments":{"name":"assignments","type":"\u0019\n","is_mandatory":true,"title":"Microsoft Graph Beta Device Compliance Policy"},"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true,"title":"Microsoft Graph Beta Device Compliance Policy"},"description":{"name":"description","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Device Compliance Policy"},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Device Compliance Policy"},"id":{"name":"id","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Device Compliance Policy"},"lastModifiedDateTime":{"name":"lastModifiedDateTime","type":"\t","is_mandatory":true,"title":"Microsoft Graph Beta Device Compliance Policy"},"properties":{"name":"properties","type":"\n","is_mandatory":true,"title":"Microsoft Graph Beta Device Compliance Policy"},"roleScopeTagIds":{"name":"roleScopeTagIds","type":"\u0019\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Device Compliance Policy"},"version":{"name":"version","type":"\u0005","is_mandatory":true,"title":"Microsoft Graph Beta Device Compliance Policy"}},"title":"Microsoft Graph Beta Device Compliance Policy"},"msgraph.beta.devicemanagement.deviceconfiguration":{"id":"msgraph.beta.devicemanagement.deviceconfiguration","name":"msgraph.beta.devicemanagement.deviceconfiguration","fields":{"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true,"title":"Microsoft Graph Beta Device Configuration"},"description":{"name":"description","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Device Configuration"},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Device Configuration"},"id":{"name":"id","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Device Configuration"},"lastModifiedDateTime":{"name":"lastModifiedDateTime","type":"\t","is_mandatory":true,"title":"Microsoft Graph Beta Device Configuration"},"properties":{"name":"properties","type":"\n","is_mandatory":true,"title":"Microsoft Graph Beta Device Configuration"},"roleScopeTagIds":{"name":"roleScopeTagIds","type":"\u0019\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Device Configuration"},"supportsScopeTags":{"name":"supportsScopeTags","type":"\u0004","is_mandatory":true,"title":"Microsoft Graph Beta Device Configuration"},"version":{"name":"version","type":"\u0005","is_mandatory":true,"title":"Microsoft Graph Beta Device Configuration"}},"title":"Microsoft Graph Beta Device Configuration"},"msgraph.beta.domain":{"id":"msgraph.beta.domain","name":"msgraph.beta.domain","fields":{"authenticationType":{"name":"authenticationType","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Domain"},"availabilityStatus":{"name":"availabilityStatus","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Domain"},"id":{"name":"id","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Domain"},"isAdminManaged":{"name":"isAdminManaged","type":"\u0004","is_mandatory":true,"title":"Microsoft Graph Beta Domain"},"isDefault":{"name":"isDefault","type":"\u0004","is_mandatory":true,"title":"Microsoft Graph Beta Domain"},"isInitial":{"name":"isInitial","type":"\u0004","is_mandatory":true,"title":"Microsoft Graph Beta Domain"},"isRoot":{"name":"isRoot","type":"\u0004","is_mandatory":true,"title":"Microsoft Graph Beta Domain"},"isVerified":{"name":"isVerified","type":"\u0004","is_mandatory":true,"title":"Microsoft Graph Beta Domain"},"passwordNotificationWindowInDays":{"name":"passwordNotificationWindowInDays","type":"\u0005","is_mandatory":true,"title":"Microsoft Graph Beta Domain"},"passwordValidityPeriodInDays":{"name":"passwordValidityPeriodInDays","type":"\u0005","is_mandatory":true,"title":"Microsoft Graph Beta Domain"},"serviceConfigurationRecords":{"name":"serviceConfigurationRecords","type":"\u0019\u001bmsgraph.beta.domaindnsrecord","title":"Microsoft Graph Beta Domain"},"supportedServices":{"name":"supportedServices","type":"\u0019\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Domain"}},"title":"Microsoft Graph Beta Domain"},"msgraph.beta.domaindnsrecord":{"id":"msgraph.beta.domaindnsrecord","name":"msgraph.beta.domaindnsrecord","fields":{"id":{"name":"id","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Domain DNS Record"},"isOptional":{"name":"isOptional","type":"\u0004","is_mandatory":true,"title":"Microsoft Graph Beta Domain DNS Record"},"label":{"name":"label","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Domain DNS Record"},"properties":{"name":"properties","type":"\n","is_mandatory":true,"title":"Microsoft Graph Beta Domain DNS Record"},"recordType":{"name":"recordType","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Domain DNS Record"},"supportedService":{"name":"supportedService","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Domain DNS Record"},"ttl":{"name":"ttl","type":"\u0005","is_mandatory":true,"title":"Microsoft Graph Beta Domain DNS Record"}},"title":"Microsoft Graph Beta Domain DNS Record"},"msgraph.beta.organization":{"id":"msgraph.beta.organization","name":"msgraph.beta.organization","fields":{"assignedPlans":{"name":"assignedPlans","type":"\u0019\n","is_mandatory":true,"title":"Microsoft Graph Beta Organization"},"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true,"title":"Microsoft Graph Beta Organization"},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Organization"},"id":{"name":"id","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Organization"},"verifiedDomains":{"name":"verifiedDomains","type":"\u0019\n","is_mandatory":true,"title":"Microsoft Graph Beta Organization"}},"title":"Microsoft Graph Beta Organization"},"msgraph.beta.policies":{"id":"msgraph.beta.policies","name":"msgraph.beta.policies","fields":{"adminConsentRequestPolicy":{"name":"adminConsentRequestPolicy","type":"\n","title":"Microsoft Graph Beta Policies"},"authorizationPolicy":{"name":"authorizationPolicy","type":"\n","title":"Microsoft Graph Beta Policies"},"identitySecurityDefaultsEnforcementPolicy":{"name":"identitySecurityDefaultsEnforcementPolicy","type":"\n","title":"Microsoft Graph Beta Policies"},"permissionGrantPolicies":{"name":"permissionGrantPolicies","type":"\u0019\n","title":"Microsoft Graph Beta Policies"}},"title":"Microsoft Graph Beta Policies"},"msgraph.beta.rolemanagement":{"id":"msgraph.beta.rolemanagement","name":"msgraph.beta.rolemanagement","fields":{"roleDefinitions":{"name":"roleDefinitions","type":"\u0019\u001bmsgraph.beta.rolemanagement.roledefinition","title":"Microsoft Graph Beta Role Management"}},"title":"Microsoft Graph Beta Role Management"},"msgraph.beta.rolemanagement.roleassignment":{"id":"msgraph.beta.rolemanagement.roleassignment","name":"msgraph.beta.rolemanagement.roleassignment","fields":{"id":{"name":"id","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Role Assignment"},"principal":{"name":"principal","type":"\n","is_mandatory":true,"title":"Microsoft Graph Beta Role Assignment"},"principalId":{"name":"principalId","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Role Assignment"},"roleDefinitionId":{"name":"roleDefinitionId","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Role Assignment"}},"title":"Microsoft Graph Beta Role Assignment"},"msgraph.beta.rolemanagement.roledefinition":{"id":"msgraph.beta.rolemanagement.roledefinition","name":"msgraph.beta.rolemanagement.roledefinition","fields":{"assignments":{"name":"assignments","type":"\u0019\u001bmsgraph.beta.rolemanagement.roleassignment","title":"Microsoft Graph Beta Role Definition"},"description":{"name":"description","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Role Definition"},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Role Definition"},"id":{"name":"id","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Role Definition"},"isBuiltIn":{"name":"isBuiltIn","type":"\u0004","is_mandatory":true,"title":"Microsoft Graph Beta Role Definition"},"isEnabled":{"name":"isEnabled","type":"\u0004","is_mandatory":true,"title":"Microsoft Graph Beta Role Definition"},"rolePermissions":{"name":"rolePermissions","type":"\u0019\n","is_mandatory":true,"title":"Microsoft Graph Beta Role Definition"},"templateId":{"name":"templateId","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Role Definition"},"version":{"name":"version","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Role Definition"}},"title":"Microsoft Graph Beta Role Definition"},"msgraph.beta.security":{"id":"msgraph.beta.security","name":"msgraph.beta.security","fields":{"latestSecureScores":{"name":"latestSecureScores","type":"\u001bmsgraph.beta.security.securityscore","title":"Microsoft Graph Beta Security"},"secureScores":{"name":"secureScores","type":"\u0019\u001bmsgraph.beta.security.securityscore","title":"Microsoft Graph Beta Security"}},"title":"Microsoft Graph Beta Security"},"msgraph.beta.security.securityscore":{"id":"msgraph.beta.security.securityscore","name":"msgraph.beta.security.securityscore","fields":{"activeUserCount":{"name":"activeUserCount","type":"\u0005","is_mandatory":true,"title":"Microsoft Graph Beta Security Score"},"averageComparativeScores":{"name":"averageComparativeScores","type":"\u0019\n","is_mandatory":true,"title":"Microsoft Graph Beta Security Score"},"azureTenantId":{"name":"azureTenantId","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Security Score"},"controlScores":{"name":"controlScores","type":"\u0019\n","is_mandatory":true,"title":"Microsoft Graph Beta Security Score"},"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true,"title":"Microsoft Graph Beta Security Score"},"currentScore":{"name":"currentScore","type":"\u0006","is_mandatory":true,"title":"Microsoft Graph Beta Security Score"},"enabledServices":{"name":"enabledServices","type":"\u0019\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Security Score"},"id":{"name":"id","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta Security Score"},"licensedUserCount":{"name":"licensedUserCount","type":"\u0005","is_mandatory":true,"title":"Microsoft Graph Beta Security Score"},"maxScore":{"name":"maxScore","type":"\u0006","is_mandatory":true,"title":"Microsoft Graph Beta Security Score"},"vendorInformation":{"name":"vendorInformation","type":"\n","is_mandatory":true,"title":"Microsoft Graph Beta Security Score"}},"title":"Microsoft Graph Beta Security Score"},"msgraph.beta.user":{"id":"msgraph.beta.user","name":"msgraph.beta.user","fields":{"accountEnabled":{"name":"accountEnabled","type":"\u0004","is_mandatory":true,"title":"Microsoft Graph Beta User"},"city":{"name":"city","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"companyName":{"name":"companyName","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"country":{"name":"country","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true,"title":"Microsoft Graph Beta User"},"department":{"name":"department","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"employeeId":{"name":"employeeId","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"givenName":{"name":"givenName","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"id":{"name":"id","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"jobTitle":{"name":"jobTitle","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"mail":{"name":"mail","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"mobilePhone":{"name":"mobilePhone","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"officeLocation":{"name":"officeLocation","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"otherMails":{"name":"otherMails","type":"\u0019\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"postalCode":{"name":"postalCode","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"settings":{"name":"settings","type":"\n","title":"Microsoft Graph Beta User"},"state":{"name":"state","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"streetAddress":{"name":"streetAddress","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"surname":{"name":"surname","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"userPrincipalName":{"name":"userPrincipalName","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"},"userType":{"name":"userType","type":"\u0007","is_mandatory":true,"title":"Microsoft Graph Beta User"}},"title":"Microsoft Graph Beta User"}}}