{"resources":{"ms365.exchangeonline":{"id":"ms365.exchangeonline","name":"ms365.exchangeonline","fields":{"adminAuditLogConfig":{"name":"adminAuditLogConfig","type":"\n","is_mandatory":true},"antiPhishPolicy":{"name":"antiPhishPolicy","type":"\u0019\n","is_mandatory":true},"atpPolicyForO365":{"name":"atpPolicyForO365","type":"\u0019\n","is_mandatory":true},"authenticationPolicy":{"name":"authenticationPolicy","type":"\u0019\n","is_mandatory":true},"dkimSigningConfig":{"name":"dkimSigningConfig","type":"\u0019\n","is_mandatory":true},"hostedOutboundSpamFilterPolicy":{"name":"hostedOutboundSpamFilterPolicy","type":"\u0019\n","is_mandatory":true},"mailbox":{"name":"mailbox","type":"\u0019\n","is_mandatory":true},"malwareFilterPolicy":{"name":"malwareFilterPolicy","type":"\u0019\n","is_mandatory":true},"organizationConfig":{"name":"organizationConfig","type":"\n","is_mandatory":true},"owaMailboxPolicy":{"name":"owaMailboxPolicy","type":"\u0019\n","is_mandatory":true},"phishFilterPolicy":{"name":"phishFilterPolicy","type":"\u0019\n","is_mandatory":true},"remoteDomain":{"name":"remoteDomain","type":"\u0019\n","is_mandatory":true},"roleAssignmentPolicy":{"name":"roleAssignmentPolicy","type":"\u0019\n","is_mandatory":true},"safeAttachmentPolicy":{"name":"safeAttachmentPolicy","type":"\u0019\n","is_mandatory":true},"safeLinksPolicy":{"name":"safeLinksPolicy","type":"\u0019\n","is_mandatory":true},"sharingPolicy":{"name":"sharingPolicy","type":"\u0019\n","is_mandatory":true},"transportRule":{"name":"transportRule","type":"\u0019\n","is_mandatory":true}},"title":"Microsoft 365 ExchangeOnline"},"ms365.sharepointonline":{"id":"ms365.sharepointonline","name":"ms365.sharepointonline","fields":{"spoTenant":{"name":"spoTenant","type":"\n","is_mandatory":true},"spoTenantSyncClientRestriction":{"name":"spoTenantSyncClientRestriction","type":"\n","is_mandatory":true}},"title":"Microsoft 365 SharepointOnline"},"ms365.teams":{"id":"ms365.teams","name":"ms365.teams","fields":{"csOAuthConfiguration":{"name":"csOAuthConfiguration","type":"\u0019\n","is_mandatory":true},"csTeamsClientConfiguration":{"name":"csTeamsClientConfiguration","type":"\n","is_mandatory":true}},"title":"Microsoft 365 Teams"},"msgraph.beta":{"id":"msgraph.beta","name":"msgraph.beta","fields":{"applications":{"name":"applications","type":"\u0019\u001bmsgraph.beta.application"},"domains":{"name":"domains","type":"\u0019\u001bmsgraph.beta.domain"},"organizations":{"name":"organizations","type":"\u0019\u001bmsgraph.beta.organization"},"settings":{"name":"settings","type":"\u0019\n"},"users":{"name":"users","type":"\u0019\u001bmsgraph.beta.user"}},"title":"Microsoft Graph Beta"},"msgraph.beta.application":{"id":"msgraph.beta.application","name":"msgraph.beta.application","fields":{"appId":{"name":"appId","type":"\u0007","is_mandatory":true},"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true},"id":{"name":"id","type":"\u0007","is_mandatory":true},"identifierUris":{"name":"identifierUris","type":"\u0019\u0007","is_mandatory":true},"publisherDomain":{"name":"publisherDomain","type":"\u0007","is_mandatory":true},"signInAudience":{"name":"signInAudience","type":"\u0007","is_mandatory":true}},"title":"Microsoft Graph Beta Application"},"msgraph.beta.devicemanagement":{"id":"msgraph.beta.devicemanagement","name":"msgraph.beta.devicemanagement","fields":{"deviceCompliancePolicies":{"name":"deviceCompliancePolicies","type":"\u0019\u001bmsgraph.beta.devicemanagement.devicecompliancepolicy"},"deviceConfigurations":{"name":"deviceConfigurations","type":"\u0019\u001bmsgraph.beta.devicemanagement.deviceconfiguration"}},"title":"Microsoft Graph Beta Device Management"},"msgraph.beta.devicemanagement.devicecompliancepolicy":{"id":"msgraph.beta.devicemanagement.devicecompliancepolicy","name":"msgraph.beta.devicemanagement.devicecompliancepolicy","fields":{"assignments":{"name":"assignments","type":"\u0019\n","is_mandatory":true},"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true},"description":{"name":"description","type":"\u0007","is_mandatory":true},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true},"id":{"name":"id","type":"\u0007","is_mandatory":true},"lastModifiedDateTime":{"name":"lastModifiedDateTime","type":"\t","is_mandatory":true},"properties":{"name":"properties","type":"\n","is_mandatory":true},"roleScopeTagIds":{"name":"roleScopeTagIds","type":"\u0019\u0007","is_mandatory":true},"version":{"name":"version","type":"\u0005","is_mandatory":true}},"title":"Microsoft Graph Beta Device Compliance Policy"},"msgraph.beta.devicemanagement.deviceconfiguration":{"id":"msgraph.beta.devicemanagement.deviceconfiguration","name":"msgraph.beta.devicemanagement.deviceconfiguration","fields":{"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true},"description":{"name":"description","type":"\u0007","is_mandatory":true},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true},"id":{"name":"id","type":"\u0007","is_mandatory":true},"lastModifiedDateTime":{"name":"lastModifiedDateTime","type":"\t","is_mandatory":true},"properties":{"name":"properties","type":"\n","is_mandatory":true},"roleScopeTagIds":{"name":"roleScopeTagIds","type":"\u0019\u0007","is_mandatory":true},"supportsScopeTags":{"name":"supportsScopeTags","type":"\u0004","is_mandatory":true},"version":{"name":"version","type":"\u0005","is_mandatory":true}},"title":"Microsoft Graph Beta Device Configuration"},"msgraph.beta.domain":{"id":"msgraph.beta.domain","name":"msgraph.beta.domain","fields":{"authenticationType":{"name":"authenticationType","type":"\u0007","is_mandatory":true},"availabilityStatus":{"name":"availabilityStatus","type":"\u0007","is_mandatory":true},"id":{"name":"id","type":"\u0007","is_mandatory":true},"isAdminManaged":{"name":"isAdminManaged","type":"\u0004","is_mandatory":true},"isDefault":{"name":"isDefault","type":"\u0004","is_mandatory":true},"isInitial":{"name":"isInitial","type":"\u0004","is_mandatory":true},"isRoot":{"name":"isRoot","type":"\u0004","is_mandatory":true},"isVerified":{"name":"isVerified","type":"\u0004","is_mandatory":true},"passwordNotificationWindowInDays":{"name":"passwordNotificationWindowInDays","type":"\u0005","is_mandatory":true},"passwordValidityPeriodInDays":{"name":"passwordValidityPeriodInDays","type":"\u0005","is_mandatory":true},"serviceConfigurationRecords":{"name":"serviceConfigurationRecords","type":"\u0019\u001bmsgraph.beta.domaindnsrecord"},"supportedServices":{"name":"supportedServices","type":"\u0019\u0007","is_mandatory":true}},"title":"Microsoft Graph Beta Domain"},"msgraph.beta.domaindnsrecord":{"id":"msgraph.beta.domaindnsrecord","name":"msgraph.beta.domaindnsrecord","fields":{"id":{"name":"id","type":"\u0007","is_mandatory":true},"isOptional":{"name":"isOptional","type":"\u0004","is_mandatory":true},"label":{"name":"label","type":"\u0007","is_mandatory":true},"properties":{"name":"properties","type":"\n","is_mandatory":true},"recordType":{"name":"recordType","type":"\u0007","is_mandatory":true},"supportedService":{"name":"supportedService","type":"\u0007","is_mandatory":true},"ttl":{"name":"ttl","type":"\u0005","is_mandatory":true}},"title":"Microsoft Graph Beta Domain DNS Record"},"msgraph.beta.organization":{"id":"msgraph.beta.organization","name":"msgraph.beta.organization","fields":{"assignedPlans":{"name":"assignedPlans","type":"\u0019\n","is_mandatory":true},"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true},"id":{"name":"id","type":"\u0007","is_mandatory":true},"verifiedDomains":{"name":"verifiedDomains","type":"\u0019\n","is_mandatory":true}},"title":"Microsoft Graph Beta Organization"},"msgraph.beta.policies":{"id":"msgraph.beta.policies","name":"msgraph.beta.policies","fields":{"adminConsentRequestPolicy":{"name":"adminConsentRequestPolicy","type":"\n"},"authorizationPolicy":{"name":"authorizationPolicy","type":"\n"},"identitySecurityDefaultsEnforcementPolicy":{"name":"identitySecurityDefaultsEnforcementPolicy","type":"\n"},"permissionGrantPolicies":{"name":"permissionGrantPolicies","type":"\u0019\n"}},"title":"Microsoft Graph Beta Policies"},"msgraph.beta.rolemanagement":{"id":"msgraph.beta.rolemanagement","name":"msgraph.beta.rolemanagement","fields":{"roleDefinitions":{"name":"roleDefinitions","type":"\u0019\u001bmsgraph.beta.rolemanagement.roledefinition"}},"title":"Microsoft Graph Beta Role Management"},"msgraph.beta.rolemanagement.roleassignment":{"id":"msgraph.beta.rolemanagement.roleassignment","name":"msgraph.beta.rolemanagement.roleassignment","fields":{"id":{"name":"id","type":"\u0007","is_mandatory":true},"principal":{"name":"principal","type":"\n","is_mandatory":true},"principalId":{"name":"principalId","type":"\u0007","is_mandatory":true},"roleDefinitionId":{"name":"roleDefinitionId","type":"\u0007","is_mandatory":true}},"title":"Microsoft Graph Beta Role Assignment"},"msgraph.beta.rolemanagement.roledefinition":{"id":"msgraph.beta.rolemanagement.roledefinition","name":"msgraph.beta.rolemanagement.roledefinition","fields":{"assignments":{"name":"assignments","type":"\u0019\u001bmsgraph.beta.rolemanagement.roleassignment"},"description":{"name":"description","type":"\u0007","is_mandatory":true},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true},"id":{"name":"id","type":"\u0007","is_mandatory":true},"isBuiltIn":{"name":"isBuiltIn","type":"\u0004","is_mandatory":true},"isEnabled":{"name":"isEnabled","type":"\u0004","is_mandatory":true},"rolePermissions":{"name":"rolePermissions","type":"\u0019\n","is_mandatory":true},"templateId":{"name":"templateId","type":"\u0007","is_mandatory":true},"version":{"name":"version","type":"\u0007","is_mandatory":true}},"title":"Microsoft Graph Beta Role Definition"},"msgraph.beta.security":{"id":"msgraph.beta.security","name":"msgraph.beta.security","fields":{"latestSecureScores":{"name":"latestSecureScores","type":"\u001bmsgraph.beta.security.securityscore"},"secureScores":{"name":"secureScores","type":"\u0019\u001bmsgraph.beta.security.securityscore"}},"title":"Microsoft Graph Beta Security"},"msgraph.beta.security.securityscore":{"id":"msgraph.beta.security.securityscore","name":"msgraph.beta.security.securityscore","fields":{"activeUserCount":{"name":"activeUserCount","type":"\u0005","is_mandatory":true},"averageComparativeScores":{"name":"averageComparativeScores","type":"\u0019\n","is_mandatory":true},"azureTenantId":{"name":"azureTenantId","type":"\u0007","is_mandatory":true},"controlScores":{"name":"controlScores","type":"\u0019\n","is_mandatory":true},"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true},"currentScore":{"name":"currentScore","type":"\u0006","is_mandatory":true},"enabledServices":{"name":"enabledServices","type":"\u0019\u0007","is_mandatory":true},"id":{"name":"id","type":"\u0007","is_mandatory":true},"licensedUserCount":{"name":"licensedUserCount","type":"\u0005","is_mandatory":true},"maxScore":{"name":"maxScore","type":"\u0006","is_mandatory":true},"vendorInformation":{"name":"vendorInformation","type":"\n","is_mandatory":true}},"title":"Microsoft Graph Beta Security Score"},"msgraph.beta.user":{"id":"msgraph.beta.user","name":"msgraph.beta.user","fields":{"accountEnabled":{"name":"accountEnabled","type":"\u0004","is_mandatory":true},"city":{"name":"city","type":"\u0007","is_mandatory":true},"companyName":{"name":"companyName","type":"\u0007","is_mandatory":true},"country":{"name":"country","type":"\u0007","is_mandatory":true},"createdDateTime":{"name":"createdDateTime","type":"\t","is_mandatory":true},"department":{"name":"department","type":"\u0007","is_mandatory":true},"displayName":{"name":"displayName","type":"\u0007","is_mandatory":true},"employeeId":{"name":"employeeId","type":"\u0007","is_mandatory":true},"givenName":{"name":"givenName","type":"\u0007","is_mandatory":true},"id":{"name":"id","type":"\u0007","is_mandatory":true},"jobTitle":{"name":"jobTitle","type":"\u0007","is_mandatory":true},"mail":{"name":"mail","type":"\u0007","is_mandatory":true},"mobilePhone":{"name":"mobilePhone","type":"\u0007","is_mandatory":true},"officeLocation":{"name":"officeLocation","type":"\u0007","is_mandatory":true},"otherMails":{"name":"otherMails","type":"\u0019\u0007","is_mandatory":true},"postalCode":{"name":"postalCode","type":"\u0007","is_mandatory":true},"settings":{"name":"settings","type":"\n"},"state":{"name":"state","type":"\u0007","is_mandatory":true},"streetAddress":{"name":"streetAddress","type":"\u0007","is_mandatory":true},"surname":{"name":"surname","type":"\u0007","is_mandatory":true},"userPrincipalName":{"name":"userPrincipalName","type":"\u0007","is_mandatory":true},"userType":{"name":"userType","type":"\u0007","is_mandatory":true}},"title":"Microsoft Graph Beta User"}}}