{"resources":{"ms365.exchangeonline":{"platform":{"name":["microsoft365"]},"fields":{"adminAuditLogConfig":{},"antiPhishPolicy":{},"atpPolicyForO365":{},"authenticationPolicy":{},"dkimSigningConfig":{},"hostedOutboundSpamFilterPolicy":{},"mailbox":{},"malwareFilterPolicy":{},"organizationConfig":{},"owaMailboxPolicy":{},"phishFilterPolicy":{},"remoteDomain":{},"roleAssignmentPolicy":{},"safeAttachmentPolicy":{},"safeLinksPolicy":{},"sharingPolicy":{},"transportRule":{}},"min_mondoo_version":"5.15.0"},"ms365.sharepointonline":{"platform":{"name":["microsoft365"]},"fields":{"spoTenant":{},"spoTenantSyncClientRestriction":{}},"min_mondoo_version":"5.15.0"},"ms365.teams":{"platform":{"name":["microsoft365"]},"fields":{"csOAuthConfiguration":{},"csTeamsClientConfiguration":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta":{"platform":{"name":["microsoft365"]},"fields":{"applications":{},"domains":{},"organizations":{},"settings":{},"users":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.application":{"platform":{"name":["microsoft365"]},"fields":{"appId":{},"createdDateTime":{},"displayName":{},"id":{},"identifierUris":{},"publisherDomain":{},"signInAudience":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.devicemanagement":{"platform":{"name":["microsoft365"]},"fields":{"deviceCompliancePolicies":{},"deviceConfigurations":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.devicemanagement.devicecompliancepolicy":{"platform":{"name":["microsoft365"]},"fields":{"assignments":{},"createdDateTime":{},"description":{},"displayName":{},"id":{},"lastModifiedDateTime":{},"properties":{},"roleScopeTagIds":{},"version":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.devicemanagement.deviceconfiguration":{"platform":{"name":["microsoft365"]},"fields":{"createdDateTime":{},"description":{},"displayName":{},"id":{},"lastModifiedDateTime":{},"properties":{},"roleScopeTagIds":{},"supportsScopeTags":{},"version":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.domain":{"platform":{"name":["microsoft365"]},"fields":{"authenticationType":{},"availabilityStatus":{},"id":{},"isAdminManaged":{},"isDefault":{},"isInitial":{},"isRoot":{},"isVerified":{},"passwordNotificationWindowInDays":{},"passwordValidityPeriodInDays":{},"serviceConfigurationRecords":{},"supportedServices":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.domaindnsrecord":{"platform":{"name":["microsoft365"]},"fields":{"id":{},"isOptional":{},"label":{},"properties":{},"recordType":{},"supportedService":{},"ttl":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.organization":{"platform":{"name":["microsoft365"]},"fields":{"assignedPlans":{},"createdDateTime":{},"displayName":{},"id":{},"verifiedDomains":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.policies":{"platform":{"name":["microsoft365"]},"fields":{"adminConsentRequestPolicy":{},"authorizationPolicy":{},"identitySecurityDefaultsEnforcementPolicy":{},"permissionGrantPolicies":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.rolemanagement":{"platform":{"name":["microsoft365"]},"fields":{"roleDefinitions":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.rolemanagement.roleassignment":{"platform":{"name":["microsoft365"]},"fields":{"id":{},"principal":{},"principalId":{},"roleDefinitionId":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.rolemanagement.roledefinition":{"platform":{"name":["microsoft365"]},"fields":{"assignments":{},"description":{},"displayName":{},"id":{},"isBuiltIn":{},"isEnabled":{},"rolePermissions":{},"templateId":{},"version":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.security":{"platform":{"name":["microsoft365"]},"fields":{"latestSecureScores":{},"secureScores":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.security.securityscore":{"platform":{"name":["microsoft365"]},"fields":{"activeUserCount":{},"averageComparativeScores":{},"azureTenantId":{},"controlScores":{},"createdDateTime":{},"currentScore":{},"enabledServices":{},"id":{},"licensedUserCount":{},"maxScore":{},"vendorInformation":{}},"min_mondoo_version":"5.15.0"},"msgraph.beta.user":{"platform":{"name":["microsoft365"]},"fields":{"accountEnabled":{},"city":{},"companyName":{},"country":{},"createdDateTime":{},"department":{},"displayName":{},"employeeId":{},"givenName":{},"id":{},"jobTitle":{},"mail":{},"mobilePhone":{},"officeLocation":{},"otherMails":{},"postalCode":{},"settings":{},"state":{},"streetAddress":{},"surname":{},"userPrincipalName":{},"userType":{}},"min_mondoo_version":"5.15.0"}}}